In [1]:
import numpy as np
import pandas as pd

# Teden 04: Uvoz in priprava podatkov

# Data Loading, Storage, and File Formats

## Reading and Writing Data in Text Format

### Reading text files



#### Text encoding: ASCII, Unicode, and others


**Unicode and UTF-8**

In [2]:
#kako uvažamo podatke, ki zahtevajo malo več truda, pa tudi podatke različnih tipov
#kako izvozimo podatke v različnih oblikah
#kako pripravimo in očistimo podatke

In [3]:
#če imamo šumnike, imamo probleme z ASCIIjem
#boljši je Unicode in UTF-8

In [4]:
#naredili bomo fajl in v njega zapisali par byteov
with open('out2.txt','wb') as f:
    f.write(bytes([65,66,67,255,192,193]))

In [5]:
#preberemo direkt iz linux sistema. Zadnji trije znaki so non-printable
!cat out2.txt

ABC���

In [6]:
#preberemo v Pythonu. Dobimo error, ker znaki niso bili kodirani v UTF-8 formatu
with open('out2.txt') as f:
    f.read()

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xff in position 3: invalid start byte

In [8]:
#včasih dobimo takšne dokumente, ki vsebujejo znake, ki jih ne znamo prebrati
#zato ko odpiramo takšne fajle, naredimo tako in bo ignoriral čudne znake:
with open('out2.txt', errors = 'ignore') as f:
    print(f.read())

ABC


`ABCÿÀÁ`

In [9]:
#druga opcija je, da namesto ignore rečemo replace:
with open('out2.txt', errors = 'replace') as f:
    print(f.read())

ABC���

In [10]:
#lahko tudi tako, da Python izpiše dejansko tisto, kar je tamo pisalo
with open('out2.txt', errors = 'backslashreplace') as f:
    print(f.read())

ABC\xff\xc0\xc1

#### Unstructured text

In [11]:
#takega teksta ne moremo kar uvoziti v pandas dataframe
!cat data/DATA_test2.txt

Call me Ishmael. Some years ago--never mind how long precisely-- having little or no money in my purse, and nothing particular to interest me on shore, I thought I would sail about a little and see the watery part of the world. It is a way I have of driving off the spleen and regulating the circulation. Whenever I find myself growing grim about the mouth; whenever it is a damp, drizzly November in my soul; whenever I find myself involuntarily pausing before coffin warehouses, and bringing up the rear of every funeral I meet; and especially whenever my hypos get such an upper hand of me, that it requires a strong moral principle to prevent me from deliberately stepping into the street, and methodically knocking people's hats off--then, I account it high time to get to sea as soon as I can. This is my substitute for pistol and ball. With a philosophical flourish Cato throws himself upon his sword; I quietly take to the ship. There is nothing surprising in this. If they but knew it, almost all men in their degree, some time or other, cherish very nearly the same feelings towards the ocean with me.

There now is your insular city of the Manhattoes, belted round by wharves as Indian isles by coral reefs--commerce surrounds it with her surf. Right and left, the streets take you waterward. Its extreme downtown is the battery, where that noble mole is washed by waves, and cooled by breezes, which a few hours previous were out of sight of land. Look at the crowds of water-gazers there.

In [12]:
#kako bi ločili vsak odstavek kot svoj element v listi - uporabimo split metodo z delimiterjem \n\n
with open('data/DATA_test2.txt') as f:
    tekst = f.read()
    tekst_odstavki = tekst.split('\n\n')

In [13]:
tekst_odstavki

["Call me Ishmael. Some years ago--never mind how long precisely-- having little or no money in my purse, and nothing particular to interest me on shore, I thought I would sail about a little and see the watery part of the world. It is a way I have of driving off the spleen and regulating the circulation. Whenever I find myself growing grim about the mouth; whenever it is a damp, drizzly November in my soul; whenever I find myself involuntarily pausing before coffin warehouses, and bringing up the rear of every funeral I meet; and especially whenever my hypos get such an upper hand of me, that it requires a strong moral principle to prevent me from deliberately stepping into the street, and methodically knocking people's hats off--then, I account it high time to get to sea as soon as I can. This is my substitute for pistol and ball. With a philosophical flourish Cato throws himself upon his sword; I quietly take to the ship. There is nothing surprising in this. If they but knew it, almost all men in their degree, some time or other, cherish very nearly the same feelings towards the ocean with me.",
 'There now is your insular city of the Manhattoes, belted round by wharves as Indian isles by coral reefs--commerce surrounds it with her surf. Right and left, the streets take you waterward. Its extreme downtown is the battery, where that noble mole is washed by waves, and cooled by breezes, which a few hours previous were out of sight of land. Look at the crowds of water-gazers there.']

In [24]:
#kako pogosto se pojavlja kakšna beseda?
#moramo dobiti posamezne besede brez pik, presledkov, vejic, velikih/malih črk itd.
with open('data/DATA_test2.txt') as f:
    tekst = f.read()
    tekst_odstavki = tekst.split('\n\n')

In [27]:
tekst_mali = tekst_odstavki[1].lower()

In [28]:
tekst_mali

'there now is your insular city of the manhattoes, belted round by wharves as indian isles by coral reefs--commerce surrounds it with her surf. right and left, the streets take you waterward. its extreme downtown is the battery, where that noble mole is washed by waves, and cooled by breezes, which a few hours previous were out of sight of land. look at the crowds of water-gazers there.'

In [29]:
tekst_mali = tekst_mali.replace('.','')

In [30]:
tekst_mali

'there now is your insular city of the manhattoes, belted round by wharves as indian isles by coral reefs--commerce surrounds it with her surf right and left, the streets take you waterward its extreme downtown is the battery, where that noble mole is washed by waves, and cooled by breezes, which a few hours previous were out of sight of land look at the crowds of water-gazers there'

In [31]:
tekst_mali.split()

['there',
 'now',
 'is',
 'your',
 'insular',
 'city',
 'of',
 'the',
 'manhattoes,',
 'belted',
 'round',
 'by',
 'wharves',
 'as',
 'indian',
 'isles',
 'by',
 'coral',
 'reefs--commerce',
 'surrounds',
 'it',
 'with',
 'her',
 'surf',
 'right',
 'and',
 'left,',
 'the',
 'streets',
 'take',
 'you',
 'waterward',
 'its',
 'extreme',
 'downtown',
 'is',
 'the',
 'battery,',
 'where',
 'that',
 'noble',
 'mole',
 'is',
 'washed',
 'by',
 'waves,',
 'and',
 'cooled',
 'by',
 'breezes,',
 'which',
 'a',
 'few',
 'hours',
 'previous',
 'were',
 'out',
 'of',
 'sight',
 'of',
 'land',
 'look',
 'at',
 'the',
 'crowds',
 'of',
 'water-gazers',
 'there']


## Delimited flat files

In [32]:
#neke fajle, ki so npr csv fajli in so strukturirani z nekim ločilom
line = 'Ljubljana|1966/01/01|14.14|699'

In [34]:
#lahko tako, ampak ne delamo tako s csv fajli
print(line.split('|'))

['Ljubljana', '1966/01/01', '14.14', '699']

**VAJA**

### The csv module

In [36]:
cat data/DATA_temp_data.txt

State|Month Day, Year Code|Avg Daily Max Air Temperature (F)|Record Count for Daily Max Air Temp (F)
Illinois|1979/01/01|17.48|994
Illinois|1979/01/02|4.64|994
Illinois|1979/01/03|11.05|994
Illinois|1979/01/04|9.51|994
Illinois|1979/05/15|68.42|994
Illinois|1979/05/16|70.29|994
Illinois|1979/05/17|75.34|994
Illinois|1979/05/18|79.13|994
Illinois|1979/05/19|74.94|994

In [37]:
#kako to dobimo v list?
import csv

In [40]:
with open('data/DATA_temp_data.txt', newline = '') as f:
    results = [fields for fields in csv.reader(f, delimiter = '|')]
    print(results)

[['State', 'Month Day, Year Code', 'Avg Daily Max Air Temperature (F)', 'Record Count for Daily Max Air Temp (F)'], ['Illinois', '1979/01/01', '17.48', '994'], ['Illinois', '1979/01/02', '4.64', '994'], ['Illinois', '1979/01/03', '11.05', '994'], ['Illinois', '1979/01/04', '9.51', '994'], ['Illinois', '1979/05/15', '68.42', '994'], ['Illinois', '1979/05/16', '70.29', '994'], ['Illinois', '1979/05/17', '75.34', '994'], ['Illinois', '1979/05/18', '79.13', '994'], ['Illinois', '1979/05/19', '74.94', '994']]

In [41]:
#to v prejšnji vrstici je bilo kar zamudno, zato pogledamo kako nam to pandas poenostavi

### Reading and Writing Data in Text Format with pandas

[Dokumentacija](http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)

<table border="1" class="colwidths-given docutils">
<colgroup>
<col width="12%">
<col width="40%">
<col width="24%">
<col width="24%">
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Format Type</th>
<th class="head">Data Description</th>
<th class="head">Reader</th>
<th class="head">Writer</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a></td>
<td><a class="reference internal" href="#io-read-csv-table"><span class="std std-ref">read_csv</span></a></td>
<td><a class="reference internal" href="#io-store-in-csv"><span class="std std-ref">to_csv</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td><a class="reference external" href="https://www.json.org/">JSON</a></td>
<td><a class="reference internal" href="#io-json-reader"><span class="std std-ref">read_json</span></a></td>
<td><a class="reference internal" href="#io-json-writer"><span class="std std-ref">to_json</span></a></td>
</tr>
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/HTML">HTML</a></td>
<td><a class="reference internal" href="#io-read-html"><span class="std std-ref">read_html</span></a></td>
<td><a class="reference internal" href="#io-html"><span class="std std-ref">to_html</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td>Local clipboard</td>
<td><a class="reference internal" href="#io-clipboard"><span class="std std-ref">read_clipboard</span></a></td>
<td><a class="reference internal" href="#io-clipboard"><span class="std std-ref">to_clipboard</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Microsoft_Excel">MS Excel</a></td>
<td><a class="reference internal" href="#io-excel-reader"><span class="std std-ref">read_excel</span></a></td>
<td><a class="reference internal" href="#io-excel-writer"><span class="std std-ref">to_excel</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://support.hdfgroup.org/HDF5/whatishdf5.html">HDF5 Format</a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">read_hdf</span></a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">to_hdf</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://github.com/wesm/feather">Feather Format</a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">read_feather</span></a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">to_feather</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://parquet.apache.org/">Parquet Format</a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">read_parquet</span></a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">to_parquet</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://msgpack.org/index.html">Msgpack</a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">read_msgpack</span></a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">to_msgpack</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Stata">Stata</a></td>
<td><a class="reference internal" href="#io-stata-reader"><span class="std std-ref">read_stata</span></a></td>
<td><a class="reference internal" href="#io-stata-writer"><span class="std std-ref">to_stata</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SAS_(software)">SAS</a></td>
<td><a class="reference internal" href="#io-sas-reader"><span class="std std-ref">read_sas</span></a></td>
<td>&nbsp;</td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://docs.python.org/3/library/pickle.html">Python Pickle Format</a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">read_pickle</span></a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">to_pickle</span></a></td>
</tr>
<tr class="row-even"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SQL">SQL</a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">read_sql</span></a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">to_sql</span></a></td>
</tr>
<tr class="row-odd"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/BigQuery">Google Big Query</a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">read_gbq</span></a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">to_gbq</span></a></td>
</tr>
</tbody>
</table>

#### CSV data

In [42]:
#ko beremo podatke s csv_read, nam sam izbere najboljši tip podatkov za posamezne stolpce

In [43]:
!cat data/DATA_ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [44]:
df = pd.read_csv('data/DATA_ex1.csv')

In [45]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [47]:
#lahko tudi s funkcijo read_table, moramo pa nastaviti separator. FutureWarning: jo bodo opustili
pd.read_table('data/DATA_ex1.csv', sep=',')

/home/mladen/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [49]:
#primer 2
#nimamo headerja v csv podatkih
!cat data/DATA_ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [50]:
#če naredimo kot do zdaj, bo prvo vrstico uporabil kot header, to ni kul
df = pd.read_csv('data/DATA_ex2.csv')

In [51]:
df

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [53]:
#lahko izpustimo header
df = pd.read_csv('data/DATA_ex2.csv', header = None)

In [54]:
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [55]:
#lahko podamo lastna imena stolpcev
df = pd.read_csv('data/DATA_ex2.csv', names = ['a','b','c','d', 'message'])

In [56]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [57]:
#naj message postane index od dataframea. Lahko to naredimo že pri branju
df = pd.read_csv('data/DATA_ex2.csv',
                names = ['a','b','c','d', 'message'],
                index_col = 'message')

In [58]:
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [59]:
#primer 3
!cat data/DATA_ex3.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [64]:
#radi bi preskočili opise, ki so označeni z "#"
#uporabimo parameter skiprows
df = pd.read_csv('data/DATA_ex3.csv',
                index_col = 'message',
                skiprows = [0,2,3])

In [65]:
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

##### Primer

In [66]:
!head -n 3 data/DATA_BL-Flickr-Images-Book.csv

Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
000000206,,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",,,,,monographic,http://www.flickr.com/photos/britishlibrary/tags/sysnum000000206,British Library HMNTS 12641.b.30.
000000216,,London; Virtue & Yorston,1868,Virtue & Co.,"All for Greed. [A novel. The dedication signed: A. A. A., i.e. Marie Pauline Rose, Baroness Blaze de Bury.]","A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",,,,,monographic,http://www.flickr.com/photos/britishlibrary/tags/sysnum000000216,British Library HMNTS 12626.cc.2.

In [67]:
#ta fajl je precej velik (29MB)
#splača se nam prebrati prvih nekaj vrstic, da vse nastavimo, šele nato pa vse loadamo
df = pd.read_csv('data/DATA_BL-Flickr-Images-Book.csv', nrows = 5)

In [68]:
df

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 10369.bbb.15.
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9007.d.28.

In [69]:
#če bi radi uvozili samo par stolpcev
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 15 columns):
Identifier                5 non-null int64
Edition Statement         1 non-null object
Place of Publication      5 non-null object
Date of Publication       5 non-null object
Publisher                 5 non-null object
Title                     5 non-null object
Author                    5 non-null object
Contributors              5 non-null object
Corporate Author          0 non-null float64
Corporate Contributors    0 non-null float64
Former owner              0 non-null float64
Engraver                  0 non-null float64
Issuance type             5 non-null object
Flickr URL                5 non-null object
Shelfmarks                5 non-null object
dtypes: float64(4), int64(1), object(10)
memory usage: 680.0+ bytes

In [70]:
df.columns.tolist()

['Identifier',
 'Edition Statement',
 'Place of Publication',
 'Date of Publication',
 'Publisher',
 'Title',
 'Author',
 'Contributors',
 'Corporate Author',
 'Corporate Contributors',
 'Former owner',
 'Engraver',
 'Issuance type',
 'Flickr URL',
 'Shelfmarks']

In [71]:
#če imamo ogromno podatkov, se nam splača, da sami predpišemo podatkovne tipe stolpcev
df = pd.read_csv('data/DATA_BL-Flickr-Images-Book.csv',
                 nrows = 5,
                 usecols = ['Identifier','Place of Publication','Date of Publication'],
                 dtype = {'Identifier': int, 'Place of Publication': str, 'Date of Publication': str},
                 index_col = 0
    )

In [72]:
df

                Place of Publication Date of Publication
Identifier
206                           London         1879 [1878]
216         London; Virtue & Yorston                1868
218                           London                1869
472                           London                1851
480                           London                1857

**Writing data**

In [73]:
data = pd.read_csv('data/DATA_ex3.csv', skiprows = [0,2,3])

In [74]:
data

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [75]:
#te podatke bi radi vpisali v csv
data.to_csv('out1.csv')

In [76]:
#lahko tudi spremenimo delimiter
data.to_csv('out1.csv',sep = '|')

In [77]:
!cat 'out1.csv'

|a|b|c|d|message
0|1|2|3|4|hello
1|5|6|7|8|world
2|9|10|11|12|foo

In [78]:
#če nočemo imeti headerjev in indexov
data.to_csv('out1.csv',index = False, header = False)

In [79]:
!cat 'out1.csv'

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [82]:
#lahko tudi sami poimenujemo stolpce v CSV fajlu
data.to_csv('out1.csv',index = False, columns = ['a','b','c'])

In [83]:
!cat 'out1.csv'

a,b,c
1,2,3
5,6,7
9,10,11

#### JSON Data

In [1]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [2]:
#en najbolj pogostih načinov zapisa podatkov, posebej na spletu
#Javascript Object Notation

In [5]:
!head -n 1 data/DATA_health_inspection_chi_sample.json

{"address":"5255 W MADISON ST ","aka_name":"RED SNAPPER FISH CHICKEN & PIZZA","city":"CHICAGO","dba_name":"RED SNAPPER FISH CHICKEN & PIZZA","facility_type":"Restaurant","inspection_date":"2016-09-26T00:00:00.000","inspection_id":1965287,"inspection_type":"Canvass","latitude":41.8802365439,"license_":1991820.0,"location":{"type":"Point","coordinates":[-87.7572203921,41.8802365439]},"longitude":-87.7572203921,"results":"Pass w\/ Conditions","risk":"Risk 1 (High)","state":"IL","violations":"35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN THE WALLS AT WALL BASE NEAR THE MIXER IN REAR OF PREMISES AND THE PREP AREA OF FOOD SPILLS AND CLEAN THE WALL VENT IN PREP AREA ,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN THE INTERIOR PANEL OF THE ICE MACHINE IN REAR OF PREMISES | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS THROUGHOUT PREMISES,ALONG WALL BASE AND CORNERS OF GREASE AND DIRT BUILD-UP,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE A LIGHT SHIELD COVER FOR THE WALK-IN FREEZER IN REAR OF PREMISES | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: OBSERVED NO CHEMICAL TEST STRIPS TO TEST THE SANITIZER AT 3 COMPARTMENT SINK,WHEN SINK IS SET UP FOR WASH,RINSE AND SANITIZE,INSTRUCTED TO PROVIDE SERIOUS VIOLATION 7-38-030 | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE A THERMOMETER INSIDE THE PREP COOLER IN PREP AREA","zip":60644.0}

In [6]:
#za občutek se splača prilepiti eno vrstico podatkov v spletno stran https://jsonformatter.curiousconcept.com/
#ali podobno, da nam jih lepše formatira

In [7]:
import json

In [8]:
#moramo prebirati vsako vrstico posebej in jo shraniti v Python list

In [9]:
dta = []

In [10]:
with open('data/DATA_health_inspection_chi_sample.json') as json_file:
    for line in json_file:
        line = json.loads(line)
        dta.append(line)

In [11]:
dta[0]

{'address': '5255 W MADISON ST ',
 'aka_name': 'RED SNAPPER FISH CHICKEN & PIZZA',
 'city': 'CHICAGO',
 'dba_name': 'RED SNAPPER FISH CHICKEN & PIZZA',
 'facility_type': 'Restaurant',
 'inspection_date': '2016-09-26T00:00:00.000',
 'inspection_id': 1965287,
 'inspection_type': 'Canvass',
 'latitude': 41.8802365439,
 'license_': 1991820.0,
 'location': {'type': 'Point', 'coordinates': [-87.7572203921, 41.8802365439]},
 'longitude': -87.7572203921,
 'results': 'Pass w/ Conditions',
 'risk': 'Risk 1 (High)',
 'state': 'IL',
 'violations': '35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN THE WALLS AT WALL BASE NEAR THE MIXER IN REAR OF PREMISES AND THE PREP AREA OF FOOD SPILLS AND CLEAN THE WALL VENT IN PREP AREA ,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN THE INTERIOR PANEL OF THE ICE MACHINE IN REAR OF PREMISES | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS THROUGHOUT PREMISES,ALONG WALL BASE AND CORNERS OF GREASE AND DIRT BUILD-UP,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE A LIGHT SHIELD COVER FOR THE WALK-IN FREEZER IN REAR OF PREMISES | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: OBSERVED NO CHEMICAL TEST STRIPS TO TEST THE SANITIZER AT 3 COMPARTMENT SINK,WHEN SINK IS SET UP FOR WASH,RINSE AND SANITIZE,INSTRUCTED TO PROVIDE SERIOUS VIOLATION 7-38-030 | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE A THERMOMETER INSIDE THE PREP COOLER IN PREP AREA',
 'zip': 60644.0}

In [13]:
len(dta)

1000

##### Vaja

In [19]:
#to je ta funkcija, ki gre v object_hook
#izbriše key "location". Če ga ne najde, spustimo ta record (to je tisti "pass")
def remove_entry(record):
    try:
        del record['location']
    except KeyError:
        pass
    return record

In [20]:
#object_hook vzame neko funkcijo in jo izvrši nad vsakim objektom, ki ga naložimo
def parse_json(record):
    return json.loads(record, object_hook=remove_entry)

In [21]:
#uvozimo podatke, a bez key 'location'
with open('data/DATA_health_inspection_chi_sample.json') as json_file:
    dta = [parse_json(line) for line in json_file]

In [23]:
dta[0]

{'address': '5255 W MADISON ST ',
 'aka_name': 'RED SNAPPER FISH CHICKEN & PIZZA',
 'city': 'CHICAGO',
 'dba_name': 'RED SNAPPER FISH CHICKEN & PIZZA',
 'facility_type': 'Restaurant',
 'inspection_date': '2016-09-26T00:00:00.000',
 'inspection_id': 1965287,
 'inspection_type': 'Canvass',
 'latitude': 41.8802365439,
 'license_': 1991820.0,
 'longitude': -87.7572203921,
 'results': 'Pass w/ Conditions',
 'risk': 'Risk 1 (High)',
 'state': 'IL',
 'violations': '35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN THE WALLS AT WALL BASE NEAR THE MIXER IN REAR OF PREMISES AND THE PREP AREA OF FOOD SPILLS AND CLEAN THE WALL VENT IN PREP AREA ,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN THE INTERIOR PANEL OF THE ICE MACHINE IN REAR OF PREMISES | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS THROUGHOUT PREMISES,ALONG WALL BASE AND CORNERS OF GREASE AND DIRT BUILD-UP,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE A LIGHT SHIELD COVER FOR THE WALK-IN FREEZER IN REAR OF PREMISES | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: OBSERVED NO CHEMICAL TEST STRIPS TO TEST THE SANITIZER AT 3 COMPARTMENT SINK,WHEN SINK IS SET UP FOR WASH,RINSE AND SANITIZE,INSTRUCTED TO PROVIDE SERIOUS VIOLATION 7-38-030 | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE A THERMOMETER INSIDE THE PREP COOLER IN PREP AREA',
 'zip': 60644.0}

##### Reading JSON with pandas

In [26]:
import pandas as pd
import numpy as np

In [27]:
!cat data/DATA_ex4.json

[{"a": 1, "b": 2, "c": 3},
{"a": 4, "b": 5, "c": 6},
{"a": 7, "b": 8, "c": 9}]

In [28]:
#pandas avtomatsko uvozi json v dataframe

In [29]:
data = pd.read_json('data/DATA_ex4.json')

In [30]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [31]:
#probamo uvoziti podatke iz prejšnjega primera

In [34]:
#ne zna, ker je prekompleksen json
#gremo v dokumenntacijo in pogledamo, kaj lahko naredimo
data = pd.read_json('data/DATA_health_inspection_chi_sample.json')

ValueError: Trailing data

In [35]:
#tam vidimo parameter 'lines' - vsak objekt prebere kot svojo vrstico
data = pd.read_json('data/DATA_health_inspection_chi_sample.json', lines = True)

In [36]:
data.head()

,address,aka_name,city,dba_name,facility_type,inspection_date,inspection_id,inspection_type,latitude,license_,location,longitude,results,risk,state,violations,zip
0,5255 W MADISON ST,RED SNAPPER FISH CHICKEN & PIZZA,CHICAGO,RED SNAPPER FISH CHICKEN & PIZZA,Restaurant,2016-09-26T00:00:00.000,1965287,Canvass,41.880237,1991820.0,"{'type': 'Point', 'coordinates': [-87.75722039...",-87.757220,Pass w/ Conditions,Risk 1 (High),IL,"35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTR...",60644
1,5958 W DIVERSEY AVE,TAQUERIA MORELOS,CHICAGO,TAQUERIA MORELOS,Restaurant,2014-02-06T00:00:00.000,1329698,Canvass,41.931250,2099479.0,"{'type': 'Point', 'coordinates': [-87.77590699...",-87.775907,Pass,Risk 1 (High),IL,33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...,60639
2,5400-5402 N CLARK ST,HAMBURGER MARY'S/MARY'S REC ROOM,CHICAGO,HAMBURGER MARY'S CHICAGO/MARY'S REC ROOM,Restaurant,2010-12-03T00:00:00.000,470787,SFP,41.979884,1933748.0,"{'type': 'Point', 'coordinates': [-87.66842948...",-87.668429,Fail,Risk 1 (High),IL,"6. HANDS WASHED AND CLEANED, GOOD HYGIENIC PRA...",60640
3,2804 N CLARK ST,Wells Street Popcorn,CHICAGO,Wells Street Popcorn,Restaurant,2010-02-01T00:00:00.000,68091,Canvass,41.932921,1954774.0,"{'type': 'Point', 'coordinates': [-87.64515454...",-87.645155,Pass,Risk 2 (Medium),IL,None,60657
4,2409 N WESTERN AVE,CHICAGO CUPCAKE,CHICAGO,CHICAGO CUPCAKE LLC.,Mobile Food Dispenser,2013-05-03T00:00:00.000,1335320,License Re-Inspection,41.925218,2232391.0,"{'type': 'Point', 'coordinates': [-87.68750659...",-87.687507,Fail,Risk 3 (Low),IL,32. FOOD AND NON-FOOD CONTACT SURFACES PROPERL...,60647

In [37]:
#ni slabo, ampak dobra praksa je, da uporabimo parameter 'orient'
#v našem primeru so key = ime vrstice
#damo orient = record

In [38]:
data = pd.read_json('data/DATA_health_inspection_chi_sample.json',
                   lines = True,
                   orient = 'records')

In [39]:
data.head()

,address,aka_name,city,dba_name,facility_type,inspection_date,inspection_id,inspection_type,latitude,license_,location,longitude,results,risk,state,violations,zip
0,5255 W MADISON ST,RED SNAPPER FISH CHICKEN & PIZZA,CHICAGO,RED SNAPPER FISH CHICKEN & PIZZA,Restaurant,2016-09-26T00:00:00.000,1965287,Canvass,41.880237,1991820.0,"{'type': 'Point', 'coordinates': [-87.75722039...",-87.757220,Pass w/ Conditions,Risk 1 (High),IL,"35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTR...",60644
1,5958 W DIVERSEY AVE,TAQUERIA MORELOS,CHICAGO,TAQUERIA MORELOS,Restaurant,2014-02-06T00:00:00.000,1329698,Canvass,41.931250,2099479.0,"{'type': 'Point', 'coordinates': [-87.77590699...",-87.775907,Pass,Risk 1 (High),IL,33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSI...,60639
2,5400-5402 N CLARK ST,HAMBURGER MARY'S/MARY'S REC ROOM,CHICAGO,HAMBURGER MARY'S CHICAGO/MARY'S REC ROOM,Restaurant,2010-12-03T00:00:00.000,470787,SFP,41.979884,1933748.0,"{'type': 'Point', 'coordinates': [-87.66842948...",-87.668429,Fail,Risk 1 (High),IL,"6. HANDS WASHED AND CLEANED, GOOD HYGIENIC PRA...",60640
3,2804 N CLARK ST,Wells Street Popcorn,CHICAGO,Wells Street Popcorn,Restaurant,2010-02-01T00:00:00.000,68091,Canvass,41.932921,1954774.0,"{'type': 'Point', 'coordinates': [-87.64515454...",-87.645155,Pass,Risk 2 (Medium),IL,None,60657
4,2409 N WESTERN AVE,CHICAGO CUPCAKE,CHICAGO,CHICAGO CUPCAKE LLC.,Mobile Food Dispenser,2013-05-03T00:00:00.000,1335320,License Re-Inspection,41.925218,2232391.0,"{'type': 'Point', 'coordinates': [-87.68750659...",-87.687507,Fail,Risk 3 (Low),IL,32. FOOD AND NON-FOOD CONTACT SURFACES PROPERL...,60647

In [40]:
#čeprav prikaže samo delček teksta v keyju 'violations', je dejansko celoten tekst v dataframeu

#### Reading Microsoft Excel Files

In [41]:
#podprti so Exceli od 2003 naprej
#različne knjižnice so na različnih operacijskih sistemih
#če inštaliramo Anaconda, bi moralo biti vse notri, če pa inštaliramo vse ročno, mogoče moramo inštalirati še kaj dodatno

In [42]:
xlsx = pd.ExcelFile('data/DATA_SampleData.xlsx')

In [45]:
pd.read_excel(xlsx, 'Sheet1').head()

   Unnamed: 0  OrderDate   Region      Rep    Item  Units  Unit Cost   Total
0           0 2018-01-06     East    Jones  Pencil     95       1.99  189.05
1           1 2018-01-23  Central   Kivell  Binder     50      19.99  999.50
2           2 2018-02-09  Central  Jardine  Pencil     36       4.99  179.64
3           3 2018-02-26  Central     Gill     Pen     27      19.99  539.73
4           4 2018-03-15     West  Sorvino  Pencil     56       2.99  167.44

In [48]:
#obstaja tudi hitrejši in krajši način, oboje pa je prav
frame = pd.read_excel('data/DATA_SampleData.xlsx', 'Sheet1')

In [49]:
frame.head()

   Unnamed: 0  OrderDate   Region      Rep    Item  Units  Unit Cost   Total
0           0 2018-01-06     East    Jones  Pencil     95       1.99  189.05
1           1 2018-01-23  Central   Kivell  Binder     50      19.99  999.50
2           2 2018-02-09  Central  Jardine  Pencil     36       4.99  179.64
3           3 2018-02-26  Central     Gill     Pen     27      19.99  539.73
4           4 2018-03-15     West  Sorvino  Pencil     56       2.99  167.44

In [50]:
#zapisovanje df-ja v excel

In [51]:
frame1 = frame.head()

In [52]:
frame1.to_excel('out.xlsx')

## Data Cleaning and Preparation

### Handling Missing Data

#### Trade-Offs in Missing Data Conventions

#### Missing Data in Pandas

#### None: Pythonic missing data

In [53]:
# v praksi večino časa pripravljamo podatkov (80% v povprečju)
# pandas nam omogoča, da to naredimmo hitro, saj ima veliko za to namenjenih funkcij
# najprej manjkajoče vrednosti, nekonsistentno formatiranje, narobe napisani podatki, podvojeni, outlierji ...
#

In [54]:
#kako rešujemo manjkajoče podatke
#
#obstajajo različna označevanja za manjkajoče podatke: nan, null, -9999, ...
# v osnovi sta dva načina za označevanje manjkajočih podatkov:
# 1. masking approach
#    imamo poleg podatkov še dodatni stolpec (bool), ki pove če je ta podatek manjkajoč
#    slabost: za vsak stolpec rabimo še en stolpec -> velika količina podatkov
# 2. sentinel approach
#    manjkajoči podatek je zamenjan z neko vrednostjo (številka, nan, ...)
#    slabost: ni odvečnih podatkov, znotraj samih podatkov pa so eni čudni podatki, za katere rabimo CPU moč (obdelava)
#
# ni optimalne rešitve, izbiramo od primera do primera
#
# sam pandas za manjkajoče podatke uporablja numpy knjižnico. Ta pa označuje manjkajoče podatke z nan
# to velja samo za števila s plavajočo vejico
# za druge tipe (stringi ...) tega ne moremo uporabljati
# zato v teh primerih pandas ima drugo vrednost za manjkajoče vrednosti in to je Python None object
#

In [55]:
# najprej kako je v Pythonu

In [59]:
#to bo delalo, ampak numpy objekta None ne prepozna kot manjkajočo vrednost
#zato bo cel array pretvoril v dtype = object, namesto int
#object pa ni zelo hiter in zato je v tem primeru precej overheada in deluje precej počasi
#integer tip je v numpyju veliko hitrejši kot object
vals1 = np.array([1,None,3,4,])

In [60]:
vals1

array([1, None, 3, 4], dtype=object)

In [65]:
#primerjava hitrosti: int je cca. 30x hitrejši
for dtype in ['object', 'int']:
    print('dtype = ', dtype)
    %timeit np.arange(1E6, dtype = dtype).sum()
    print()

dtype =  object
51.6 ms ± 786 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype =  int
1.51 ms ± 52.5 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [66]:
#poleg tega številk v object ne moremo niti seštevati
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

#### NaN: Missing numerical data

In [67]:
vals2 = np.array([1, np.nan, 3, 4])

In [68]:
#zato numpy in pandas uporabljajo nan (posebna floating point vrednost po IEEE standardu)

In [70]:
vals2.dtype

dtype('float64')

In [72]:
# nan lahko uporabljamo tudi v računskih operacijah
1 + np.nan

nan

In [73]:
vals2.sum()

nan

In [77]:
#še vedno dobimo nan, v praksi bi pa radi dobili 8
# zato imamo dodaten nabor funkcij  za delo z nan-i
# spredaj imajo "nan"
np.nansum(vals2)

8.0

In [78]:
#nan je samo za floating point numberje, ne moremo ga uporabljati pri stringih

#### NaN and None in Pandas

In [79]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [81]:
#pandas sam uporablja nan ali None glede na same podatke. 
# zato je v zgornjem primeru sam spremenil None v NaN. Še vedno je dtype = float64

In [82]:
x = pd.Series(range(2), dtype = int)

In [83]:
x

0    0
1    1
dtype: int64

In [85]:
x[0] = None

In [86]:
x

0    NaN
1    1.0
dtype: float64

In [87]:
# tudi v zgornjem primeru je None kar sam pretvoril v NaN

In [89]:
y = pd.Series(['sfsf','fsfs','thh'])

In [90]:
y

0    sfsf
1    fsfs
2     thh
dtype: object

In [92]:
y[0] = None

In [93]:
y

0    None
1    fsfs
2     thh
dtype: object

The following table lists the upcasting conventions in Pandas when NA values are introduced:

<table>
<thead><tr>
<th>Typeclass</th>
<th>Conversion When Storing NAs</th>
<th>NA Sentinel Value</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>floating</code></td>
<td>No change</td>
<td><code>np.nan</code></td>
</tr>
<tr>
<td><code>object</code></td>
<td>No change</td>
<td><code>None</code> or <code>np.nan</code></td>
</tr>
<tr>
<td><code>integer</code></td>
<td>Cast to <code>float64</code></td>
<td><code>np.nan</code></td>
</tr>
<tr>
<td><code>boolean</code></td>
<td>Cast to <code>object</code></td>
<td><code>None</code> or <code>np.nan</code></td>
</tr>
</tbody>
</table>

#### Operating on Null Values

- `isnull()`: Generate a boolean mask indicating missing values
- `notnull()`: Opposite of isnull()
- `dropna()`: Return a filtered version of the data
- `fillna()`: Return a copy of the data with missing values filled or imputed

##### Detecting null values

In [94]:
data = pd.Series([1, np.nan, 'hello', None])

In [95]:
# v pandasu so 4 glavne funkcije za delo z null vrednosti:
# zaznavanje, odstranjevanje, nadomeščanje ipd.
#

In [96]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [97]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [99]:
data[data.isnull() == False]

0        1
2    hello
dtype: object

In [100]:
data[data.notnull()]

0        1
2    hello
dtype: object

##### Dropping null values

In [101]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])

In [102]:
#kako odstranimo null vrednosti

In [103]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [106]:
#funkcija dropna odstrani null vrednosti

In [107]:
data.dropna()

0        1
2    hello
dtype: object

In [108]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [110]:
# za df to ni v redu, ker odstrani celotno vrstico, ki vsebuje null. To je default način

In [111]:
# po stolpcih:
df.dropna(axis = 'columns')

   2
0  2
1  5
2  6

In [112]:
#zato imamo parametre:
# parameter how (po defaultu je postavljen na 'any')
df.dropna(how = 'all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [113]:
df[3] = np.nan

In [114]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [116]:
#all izbriše le tiste stolpce, ki imajo vse vrednosti NaN
df.dropna(axis = 'columns', how = 'all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [119]:
#za nekaj vmes imamo parameter thresh. 
# najmanj koliko nenull vrednosti mora biti v vrstici, da jo pusti
# to je uporabno, če imamo nek stolpec večino manjkajočih vrednosti - mu določimo ta thresh
df.dropna(axis = 'rows', thresh = 3)

     0    1  2   3
1  2.0  3.0  5 NaN

##### Filling null values

In [126]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))

In [123]:
# boljše kot zbrisati cel stolpec ali vrstco, je včasih zamenjati manjkajoče vrednosti z drugimi
# uporabljamo funkcijo fillna()
#

In [124]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [125]:
# Nane bi zamenjali z 0
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [128]:
#manjkajoči podatek bi dopolnili s prejšnjim podatkom (ffill je metoda first fill)
# obstaja tudi bfill, ki manjkajoči podatek napolni z naslednjo vrednostjo
data.fillna(method = 'ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [133]:
# v dataframeu moramo najprej povedati po kateri osi filamo
# če je prva vrednost NaN, je ne bo imel s čim dopolniti
#če sta dva NaN en zraven drugega, potem enega nadomesti z drugim
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [132]:
df.fillna(method = 'ffill', axis = 1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

### Removing Duplicates

In [135]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [136]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [142]:
# velikokrat nočemo imeti podvojenih vrstic in to bi radi odstranili
# to naredi metoda duplicated()
# prvo vrednost, ki ima duplikate, označi kot false, ostale kot true
# tako dobljeno listo uporabimo za boolean indexing
# ali pa uporabimo metodo drop_duplicates()

In [143]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [144]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### Transforming Data Using a Function or Mapping

In [145]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [146]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [153]:
#radi bi razvrstili izdelke po živalih, od katerih pridejo
# v teh primerih najprej naredimo dictionary, v katerem mapiramo podatke
# problem so tudi male in velike črke
# lahko najprej vse spremenimo v male črke

In [157]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [158]:
lower_case = data['food'].str.lower()

In [159]:
lower_case

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [161]:
data['animal'] = lower_case.map(meat_to_animal)

In [162]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [178]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [166]:
# za zamenjevanje določenih vrednosti (ne samo NaN)
# recimo, da so vrednosti -999 manjkajoče
# najbolj optimalno je, da jih damo v NaN, da lahko pravilno računamo z njimi

In [167]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [168]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [169]:
#kaj pa, če je tudi -1000 neveljavna (ponovno zaženemo data zgoraj)

In [174]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [175]:
#lahko tudi mapiramo vrednosti

In [177]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [181]:
data.replace(list(range(-2000,0)), np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

### Change datatype

In [182]:
df = pd.read_csv('data/DATA_BL-Flickr-Images-Book.csv')

In [183]:
# ko uvozimo podatke, jim pandas že sam dodeli tip podatkov
# lahko pa jim ga dodelimo tudi sami

In [184]:
df.head(3)

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.

In [185]:
df.dtypes.value_counts()

object     11
float64     3
int64       1
dtype: int64

In [186]:
# recimo, da bi radi izbrali samo določene tipe

In [189]:
df2 = df.select_dtypes(include = ['float64', 'int64']).head(5)

In [191]:
# prvih 5 teh stolpcev dejansko imajo vrednosti NaN (slučajno)
df2

   Identifier  Corporate Author  Corporate Contributors  Engraver
0         206               NaN                     NaN       NaN
1         216               NaN                     NaN       NaN
2         218               NaN                     NaN       NaN
3         472               NaN                     NaN       NaN
4         480               NaN                     NaN       NaN

In [192]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Identifier                5 non-null int64
Corporate Author          0 non-null float64
Corporate Contributors    0 non-null float64
Engraver                  0 non-null float64
dtypes: float64(3), int64(1)
memory usage: 240.0 bytes

**[pandas.DataFrame.astype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.astype.html)**: Cast a pandas object to a specified dtype dtype.

In [194]:
# radi bi imeli identifier definiran kot int64 in ne več kot int (radi bi spremenili tip stolpca)
# to naredimo z metodo astype()

In [195]:
df2['Identifier'] = df['Identifier'].astype('float64')

In [196]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Identifier                5 non-null float64
Corporate Author          0 non-null float64
Corporate Contributors    0 non-null float64
Engraver                  0 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

### Dropping Columns in a DataFrame

In [211]:
df = pd.read_csv('data/DATA_BL-Flickr-Images-Book.csv')

In [198]:
# funkcija drop()
#

In [199]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8287 entries, 0 to 8286
Data columns (total 15 columns):
Identifier                8287 non-null int64
Edition Statement         773 non-null object
Place of Publication      8287 non-null object
Date of Publication       8106 non-null object
Publisher                 4092 non-null object
Title                     8287 non-null object
Author                    6509 non-null object
Contributors              8287 non-null object
Corporate Author          0 non-null float64
Corporate Contributors    0 non-null float64
Former owner              1 non-null object
Engraver                  0 non-null float64
Issuance type             8287 non-null object
Flickr URL                8287 non-null object
Shelfmarks                8287 non-null object
dtypes: float64(3), int64(1), object(11)
memory usage: 971.2+ KB

In [200]:
#recimo, da ne potrebujemo stolpcev, ki so v tej listi:

In [201]:
to_drop = ['Edition Statement',
    'Corporate Author',
    'Corporate Contributors',
    'Former owner',
    'Engraver',
    'Contributors',
    'Issuance type',
    'Shelfmarks']

In [208]:
# parameter 'inplace' pove, da spremenimo kar ta dataframe, na katerem delamo 
df.drop(to_drop, axis = 1, inplace = True)

In [209]:
df.head()

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
3,472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
4,480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

In [212]:
#krajši način:
df.drop(columns = to_drop, inplace = True)

### Changing the Index of a DataFrame

In [217]:
# velikokrat tisti indeks, ki je določen ob uvozu podatkov, ni tisti, ki ga potrebujemo
# recimo, da hočemo, da je index = Identifier
# na začetku je vedno pametno pogledati ta stolpec in pogledati, če je vse unique, ker pandas sam tega ne zagotavlja

In [218]:
df['Identifier'].is_unique

True

In [221]:
df = df.set_index('Identifier')

In [222]:
df.head()

,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
Identifier,,,,,,
206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
472,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
480,London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

In [224]:
df.loc[206]

Place of Publication                                               London
Date of Publication                                           1879 [1878]
Publisher                                                S. Tinsley & Co.
Title                                   Walter Forbes. [A novel.] By A. A
Author                                                              A. A.
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 206, dtype: object

### Tidying up Fields in the Data

In [225]:
# zdaj bi radi
#

In [226]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8287 entries, 206 to 4160339
Data columns (total 6 columns):
Place of Publication    8287 non-null object
Date of Publication     8106 non-null object
Publisher               4092 non-null object
Title                   8287 non-null object
Author                  6509 non-null object
Flickr URL              8287 non-null object
dtypes: object(6)
memory usage: 773.2+ KB

In [227]:
df.get_dtype_counts()

object    6
dtype: int64

In [229]:
#tudi stolpec date of publication je object, čeprav bi lahko načeloma bil integer
# so pa nekatere letnice napisane dvojno, z uporabo oglatih oklepajev
# nekatere tudi manjkajo

In [230]:
df['Date of Publication'].head(10)

Identifier
206     1879 [1878]
216            1868
218            1869
472            1851
480            1857
481            1875
519            1872
667             NaN
874            1676
1143           1679
Name: Date of Publication, dtype: object

In [231]:
df.loc[1905:, 'Date of Publication'].head(10)

Identifier
1905           1888
1929    1839, 38-54
2836           1897
2854           1865
2956        1860-63
2957           1873
3017           1866
3131           1899
4598           1814
4884           1820
Name: Date of Publication, dtype: object

In [233]:
# ko imamo številko in nekaj v oglatih oklepajih, vzamemo samo številko
# ko imamo samo številko in range, vzamemo range
# ko imamo številko in pomišljaj, vzamemo samo številko
# itd
#
# za to uporabimo Regular Expressions


 **Regular Expression**

[Regular Expression HOWTO](https://docs.python.org/3.7/howto/regex.html)

[Testiranje RE](https://regex101.com/r/3AJ1Pv/1)

In [234]:
# raw string - zato "r" pred stringom
regex = r'^(\d{4})'

In [241]:
# extract() je za to
# expand = False damo zato, da dobimo tip Series
extr = df['Date of Publication'].str.extract(regex, expand = False)

In [236]:
extr.head()

               0
Identifier
206         1879
216         1868
218         1869
472         1851
480         1857

In [237]:
extr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8287 entries, 206 to 4160339
Data columns (total 1 columns):
0    7316 non-null object
dtypes: object(1)
memory usage: 449.5+ KB

In [238]:
#še vedno je to object, čeprav so številke. Zato uporabimo funkcijo to_numeric()

In [242]:
df['Date of Publication'] = pd.to_numeric(extr)

In [243]:
df.head()

,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
Identifier,,,,,,
206,London,1879.0,S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
216,London; Virtue & Yorston,1868.0,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
218,London,1869.0,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
472,London,1851.0,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
480,London,1857.0,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

In [245]:
df['Date of Publication'].dtype

dtype('float64')

In [246]:
#koliko je še manjkajočih vrednosti, ki jih nismo uspeli spremeniti?
df['Date of Publication'].isnull().sum() / len(df)

0.11717147339205986

In [247]:
#kar 11% vseh vrednosti nam še ni uspelo popraviti

### Cleaning the Entire Dataset Using the applymap Function

In [248]:
# funkcija applymap sprejme eno našo funkcijo in jo zažene čez cel dataframe
# tako naenkrat počistimo vse

In [249]:
!head -n 20 data/DATA_university_towns.txt

Alabama[edit]
Auburn (Auburn University)[1]
Florence (University of North Alabama)
Jacksonville (Jacksonville State University)[2]
Livingston (University of West Alabama)[2]
Montevallo (University of Montevallo)[2]
Troy (Troy University)[2]
Tuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]
Tuskegee (Tuskegee University)[5]
Alaska[edit]
Fairbanks (University of Alaska Fairbanks)[2]
Arizona[edit]
Flagstaff (Northern Arizona University)[6]
Tempe (Arizona State University)
Tucson (University of Arizona)
Arkansas[edit]
Arkadelphia (Henderson State University, Ouachita Baptist University)[2]
Conway (Central Baptist College, Hendrix College, University of Central Arkansas)[2]
Fayetteville (University of Arkansas)[7]
Jonesboro (Arkansas State University)[8]

In [253]:
# to je seznam univerzitetnih mest: zvezna država [edit], nato mesto, univerza in številka, nato spet država itd.
# radi bi iz tega naredili nek normalen dataframe: Država, Mesto
# 
# zraven države je vedno [edit]
#
#

In [254]:
# naredimo list, v katerega bomo shranjevali rezultat

In [259]:
university_towns = []

In [260]:
with open('data/DATA_university_towns.txt') as file:
    for line in file:
        if '[edit]' in line:
            state = line
        else:
            university_towns.append((state,line))

In [262]:
university_towns[1:20]

[('Alabama[edit]\n', 'Florence (University of North Alabama)\n'),
 ('Alabama[edit]\n', 'Jacksonville (Jacksonville State University)[2]\n'),
 ('Alabama[edit]\n', 'Livingston (University of West Alabama)[2]\n'),
 ('Alabama[edit]\n', 'Montevallo (University of Montevallo)[2]\n'),
 ('Alabama[edit]\n', 'Troy (Troy University)[2]\n'),
 ('Alabama[edit]\n',
  'Tuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]\n'),
 ('Alabama[edit]\n', 'Tuskegee (Tuskegee University)[5]\n'),
 ('Alaska[edit]\n', 'Fairbanks (University of Alaska Fairbanks)[2]\n'),
 ('Arizona[edit]\n', 'Flagstaff (Northern Arizona University)[6]\n'),
 ('Arizona[edit]\n', 'Tempe (Arizona State University)\n'),
 ('Arizona[edit]\n', 'Tucson (University of Arizona)\n'),
 ('Arkansas[edit]\n',
  'Arkadelphia (Henderson State University, Ouachita Baptist University)[2]\n'),
 ('Arkansas[edit]\n',
  'Conway (Central Baptist College, Hendrix College, University of Central Arkansas)[2]\n'),
 ('Arkansas[edit]\n', 'Fayetteville (University of Arkansas)[7]\n'),
 ('Arkansas[edit]\n', 'Jonesboro (Arkansas State University)[8]\n'),
 ('Arkansas[edit]\n', 'Magnolia (Southern Arkansas University)[2]\n'),
 ('Arkansas[edit]\n',
  'Monticello (University of Arkansas at Monticello)[2]\n'),
 ('Arkansas[edit]\n', 'Russellville (Arkansas Tech University)[2]\n'),
 ('Arkansas[edit]\n', 'Searcy (Harding University)[5]\n')]

In [263]:
# to je že boljše, lahko bi že spravili v dataframe

In [264]:
towns_df = pd.DataFrame(university_towns, columns = ['State', 'Region name'])

In [265]:
towns_df.head(15)

               State                                        Region name
0    Alabama[edit]\n                    Auburn (Auburn University)[1]\n
1    Alabama[edit]\n           Florence (University of North Alabama)\n
2    Alabama[edit]\n  Jacksonville (Jacksonville State University)[2]\n
3    Alabama[edit]\n       Livingston (University of West Alabama)[2]\n
4    Alabama[edit]\n         Montevallo (University of Montevallo)[2]\n
5    Alabama[edit]\n                        Troy (Troy University)[2]\n
6    Alabama[edit]\n  Tuscaloosa (University of Alabama, Stillman Co...
7    Alabama[edit]\n                Tuskegee (Tuskegee University)[5]\n
8     Alaska[edit]\n    Fairbanks (University of Alaska Fairbanks)[2]\n
9    Arizona[edit]\n       Flagstaff (Northern Arizona University)[6]\n
10   Arizona[edit]\n                 Tempe (Arizona State University)\n
11   Arizona[edit]\n                   Tucson (University of Arizona)\n
12  Arkansas[edit]\n  Arkadelphia (Henderson State University, Ouach...
13  Arkansas[edit]\n  Conway (Central Baptist College, Hendrix Colle...
14  Arkansas[edit]\n         Fayetteville (University of Arkansas)[7]\n

In [266]:
# to do zdaj smo naredili v čistem Pythonu, da smo dobili dataframe.
# od zdaj naprej pa je lažje delati v pandasu

In [275]:
#to funkcijo bomo dali v applymap()
# najprej počistimo stolpec Region name

def clean_df(item):
    if ' (' in item:
        return item[:item.find(' (')]
    elif '[' in item:
        return item[:item.find('[')]
    else:
        return item

In [276]:
town_df = towns_df.applymap(clean_df)

In [277]:
town_df.head(15)

       State   Region name
0    Alabama        Auburn
1    Alabama      Florence
2    Alabama  Jacksonville
3    Alabama    Livingston
4    Alabama    Montevallo
5    Alabama          Troy
6    Alabama    Tuscaloosa
7    Alabama      Tuskegee
8     Alaska     Fairbanks
9    Arizona     Flagstaff
10   Arizona         Tempe
11   Arizona        Tucson
12  Arkansas   Arkadelphia
13  Arkansas        Conway
14  Arkansas  Fayetteville

In [279]:
# slabost te funkcije je, če imamo ogromno podatkov, ker mora narediti na vsakem podatku posebej
# potem je to počasno

### Renaming Axis Indexes

In [280]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [281]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [282]:
# radi bi vzeli prve 4 črke vsakega mesta in jih dali v all caps ter postavili za index
# lahko uporabimo map funkcijo, da mapiramo transformacijo nad objektom
# najprej definiramo funkcijo

In [283]:
transform = lambda x: x[:4].upper()

In [284]:
# kako ta funkcija deluje:
'Colorado'[:4].upper()

'COLO'

In [285]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [286]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [288]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [290]:
data.index = data.index.map(transform)

In [291]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [292]:
# lahko pa direktno uporabimo metodo rename
#

In [295]:
data.rename(index = {'OHIO': 'INDiANA'},
           columns = {'three': '333'},
           inplace = True
           )

In [296]:
data

         one  two  333  four
INDiANA    0    1    2     3
COLO       4    5    6     7
NEW        8    9   10    11

### Example: Renaming Columns and Skipping Rows

In [297]:
!head -n 5 data/DATA_olympics.csv

0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
,? Summer,01 !,02 !,03 !,Total,? Winter,01 !,02 !,03 !,Total,? Games,01 !,02 !,03 !,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70

In [305]:
# olimpijske medalje po državah (dataset iz Wikipedije)
# ne vemo kaj pomenijo vse te številke v imenih stolpcev
#

In [306]:
# ker so prava imena stolpcev verjetno v prvi vrstici podatkov, damo header = 1
olympic_df = pd.read_csv('data/DATA_olympics.csv', header = 1)

In [307]:
olympic_df.head()

,Unnamed: 0,? Summer,01 !,02 !,03 !,Total,? Winter,01 !.1,02 !.1,03 !.1,Total.1,? Games,01 !.2,02 !.2,03 !.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [308]:
# zdaj bi radi preimenovali te stolpce

In [309]:
new_names =  {'Unnamed: 0': 'Country',
    '? Summer': 'Summer Olympics',
    '01 !': 'Gold',
    '02 !': 'Silver',
    '03 !': 'Bronze',
    '? Winter': 'Winter Olympics',
    '01 !.1': 'Gold.1',
    '02 !.1': 'Silver.1',
    '03 !.1': 'Bronze.1',
    '? Games': '# Games',
    '01 !.2': 'Gold.2',
    '02 !.2': 'Silver.2',
    '03 !.2': 'Bronze.2'}

In [310]:
olympic_df.rename(columns = new_names, inplace = True)

In [311]:
olympic_df.head()

,Country,Summer Olympics,Gold,Silver,Bronze,Total,Winter Olympics,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12